apache/nuttx/arch/arm/src/nrf54l/nrf54l_serial.c
/****************************************************************************
 * arch/arm/src/nrf54l/nrf54l_serial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <string.h>
#include <stdbool.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/fs/ioctl.h>
#include <nuttx/serial/serial.h>

#ifdef CONFIG_SERIAL_TERMIOS
#  include <termios.h>
#endif

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "nrf54l_config.h"
#include "nrf54l_lowputc.h"
#include "nrf54l_serial.h"
#include "hardware/nrf54l_uarte.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Number of UART instances */

#define NRF54L_NUART 7

#if defined(HAVE_UART_DEVICE) && defined(USE_SERIALDRIVER)

/* The console is always ttyS0. */

#if defined(CONFIG_UART0_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart0port
#  define TTYS0_DEV   g_uart0port
#elif defined(CONFIG_UART1_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart1port
#  define TTYS0_DEV   g_uart1port
#elif defined(CONFIG_UART2_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart2port
#  define TTYS0_DEV   g_uart2port
#elif defined(CONFIG_UART3_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart3port
#  define TTYS0_DEV   g_uart3port
#elif defined(CONFIG_UART4_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart4port
#  define TTYS0_DEV   g_uart4port
#elif defined(CONFIG_UART5_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart5port
#  define TTYS0_DEV   g_uart5port
#elif defined(CONFIG_UART6_SERIAL_CONSOLE)
#  define CONSOLE_DEV g_uart6port
#  define TTYS0_DEV   g_uart6port
#endif

#define RX_INTERRUPTS (UARTE_INT_DMA_RX_END | UARTE_INT_ERROR | \
                       UARTE_INT_DMA_RX_BUSERROR | UARTE_INT_RXTO)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* State of one UART device */

struct nrf54l_dev_s
{
  uintptr_t     uartbase;       /* Base address of UART registers */
  uint16_t      irq;            /* IRQ associated with this UART */
  uint8_t       rxdma;          /* Receive DMA buffer */
  uint8_t       txdma;          /* Transmit DMA buffer */
  uint8_t       rxchar;         /* Completed receive byte */
  uint32_t      rxstatus;       /* Receive error status */
  bool          rxvalid;        /* Receive byte available */
  bool          rxenabled;      /* Upper-half reception enabled */
  bool          rxrecover;      /* Receiver stopping after a DMA error */
  bool          rxactive;       /* Receiver started */
  bool          txenabled;      /* Upper-half transmission enabled */
  volatile bool txbusy;         /* DMA transmitter owns txdma */

  /* UART configuration */

  struct uart_config_s config;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int  nrf54l_setup(struct uart_dev_s *dev);
static void nrf54l_shutdown(struct uart_dev_s *dev);
static int  nrf54l_attach(struct uart_dev_s *dev);
static void nrf54l_detach(struct uart_dev_s *dev);
static int  nrf54l_interrupt(int irq, void *context, void *arg);
static int  nrf54l_ioctl(struct file *filep, int cmd, unsigned long arg);
static int  nrf54l_receive(struct uart_dev_s *dev, unsigned int *status);
static void nrf54l_rxint(struct uart_dev_s *dev, bool enable);
static bool nrf54l_rxavailable(struct uart_dev_s *dev);
static void nrf54l_send(struct uart_dev_s *dev, int ch);
static void nrf54l_txint(struct uart_dev_s *dev, bool enable);
static bool nrf54l_txready(struct uart_dev_s *dev);
static bool nrf54l_txempty(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_uart_ops =
{
  .setup          = nrf54l_setup,
  .shutdown       = nrf54l_shutdown,
  .attach         = nrf54l_attach,
  .detach         = nrf54l_detach,
  .ioctl          = nrf54l_ioctl,
  .receive        = nrf54l_receive,
  .rxint          = nrf54l_rxint,
  .rxavailable    = nrf54l_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = nrf54l_send,
  .txint          = nrf54l_txint,
  .txready        = nrf54l_txready,
  .txempty        = nrf54l_txempty,
};

/* I/O buffers */

#ifdef CONFIG_NRF54L_UART0
static char g_uart0rxbuffer[CONFIG_UART0_RXBUFSIZE];
static char g_uart0txbuffer[CONFIG_UART0_TXBUFSIZE];
#endif

#ifdef CONFIG_NRF54L_UART1
static char g_uart1rxbuffer[CONFIG_UART1_RXBUFSIZE];
static char g_uart1txbuffer[CONFIG_UART1_TXBUFSIZE];
#endif

#ifdef CONFIG_NRF54L_UART2
static char g_uart2rxbuffer[CONFIG_UART2_RXBUFSIZE];
static char g_uart2txbuffer[CONFIG_UART2_TXBUFSIZE];
#endif

#ifdef CONFIG_NRF54L_UART3
static char g_uart3rxbuffer[CONFIG_UART3_RXBUFSIZE];
static char g_uart3txbuffer[CONFIG_UART3_TXBUFSIZE];
#endif

