apache/nuttx/arch/arm/src/nrf54l/nrf54l_serial.c
#ifdef CONFIG_NRF54L_UART4
static char g_uart4rxbuffer[CONFIG_UART4_RXBUFSIZE];
static char g_uart4txbuffer[CONFIG_UART4_TXBUFSIZE];
#endif

#ifdef CONFIG_NRF54L_UART5
static char g_uart5rxbuffer[CONFIG_UART5_RXBUFSIZE];
static char g_uart5txbuffer[CONFIG_UART5_TXBUFSIZE];
#endif

#ifdef CONFIG_NRF54L_UART6
static char g_uart6rxbuffer[CONFIG_UART6_RXBUFSIZE];
static char g_uart6txbuffer[CONFIG_UART6_TXBUFSIZE];
#endif

/* This describes the state of the NRF54L UART0 port. */

#ifdef CONFIG_NRF54L_UART0
static struct nrf54l_dev_s g_uart0priv =
{
  .uartbase = NRF54L_UART0_BASE,
  .irq      = NRF54L_IRQ_SERIAL20,
  .config   =
  {
    .baud      = CONFIG_UART0_BAUD,
    .parity    = CONFIG_UART0_PARITY,
    .bits      = CONFIG_UART0_BITS,
    .stopbits2 = CONFIG_UART0_2STOP,
    .txpin     = BOARD_UART0_TX_PIN,
    .rxpin     = BOARD_UART0_RX_PIN,
  },
};

static struct uart_dev_s g_uart0port =
{
  .recv =
  {
    .size   = sizeof(g_uart0rxbuffer),
    .buffer = g_uart0rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart0txbuffer),
    .buffer = g_uart0txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart0priv,
};

#endif

/* This describes the state of the NRF54L UART1 port. */

#ifdef CONFIG_NRF54L_UART1
static struct nrf54l_dev_s g_uart1priv =
{
  .uartbase = NRF54L_UART1_BASE,
  .irq      = NRF54L_IRQ_SERIAL21,
  .config   =
  {
    .baud      = CONFIG_UART1_BAUD,
    .parity    = CONFIG_UART1_PARITY,
    .bits      = CONFIG_UART1_BITS,
    .stopbits2 = CONFIG_UART1_2STOP,
    .txpin     = BOARD_UART1_TX_PIN,
    .rxpin     = BOARD_UART1_RX_PIN,
  },
};

static struct uart_dev_s g_uart1port =
{
  .recv =
  {
    .size   = sizeof(g_uart1rxbuffer),
    .buffer = g_uart1rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart1txbuffer),
    .buffer = g_uart1txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart1priv,
};

#endif

/* This describes the state of the NRF54L UART2 port. */

#ifdef CONFIG_NRF54L_UART2
static struct nrf54l_dev_s g_uart2priv =
{
  .uartbase = NRF54L_UART2_BASE,
  .irq      = NRF54L_IRQ_SERIAL22,
  .config   =
  {
    .baud      = CONFIG_UART2_BAUD,
    .parity    = CONFIG_UART2_PARITY,
    .bits      = CONFIG_UART2_BITS,
    .stopbits2 = CONFIG_UART2_2STOP,
    .txpin     = BOARD_UART2_TX_PIN,
    .rxpin     = BOARD_UART2_RX_PIN,
  },
};

static struct uart_dev_s g_uart2port =
{
  .recv =
  {
    .size   = sizeof(g_uart2rxbuffer),
    .buffer = g_uart2rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart2txbuffer),
    .buffer = g_uart2txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart2priv,
};

#endif

/* This describes the state of the NRF54L UART3 port. */

#ifdef CONFIG_NRF54L_UART3
static struct nrf54l_dev_s g_uart3priv =
{
  .uartbase = NRF54L_UART3_BASE,
  .irq      = NRF54L_IRQ_SERIAL30,
  .config   =
  {
    .baud      = CONFIG_UART3_BAUD,
    .parity    = CONFIG_UART3_PARITY,
    .bits      = CONFIG_UART3_BITS,
    .stopbits2 = CONFIG_UART3_2STOP,
    .txpin     = BOARD_UART3_TX_PIN,
    .rxpin     = BOARD_UART3_RX_PIN,
  },
};

static struct uart_dev_s g_uart3port =
{
  .recv =
  {
    .size   = sizeof(g_uart3rxbuffer),
    .buffer = g_uart3rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart3txbuffer),
    .buffer = g_uart3txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart3priv,
};

#endif

/* This describes the state of the NRF54L UART4 port. */

#ifdef CONFIG_NRF54L_UART4
static struct nrf54l_dev_s g_uart4priv =
{
  .uartbase = NRF54L_UART4_BASE,
  .irq      = NRF54L_IRQ_SERIAL00,
  .config   =
  {
    .baud      = CONFIG_UART4_BAUD,
    .parity    = CONFIG_UART4_PARITY,
    .bits      = CONFIG_UART4_BITS,
    .stopbits2 = CONFIG_UART4_2STOP,
    .txpin     = BOARD_UART4_TX_PIN,
    .rxpin     = BOARD_UART4_RX_PIN,
  },
};

static struct uart_dev_s g_uart4port =
{
  .recv =
  {
    .size   = sizeof(g_uart4rxbuffer),
    .buffer = g_uart4rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart4txbuffer),
    .buffer = g_uart4txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart4priv,
};

#endif

/* This describes the state of the NRF54L UART5 port. */

#ifdef CONFIG_NRF54L_UART5
static struct nrf54l_dev_s g_uart5priv =
{
  .uartbase = NRF54L_UART5_BASE,
  .irq      = NRF54L_IRQ_SERIAL23,
  .config   =
  {
    .baud      = CONFIG_UART5_BAUD,
    .parity    = CONFIG_UART5_PARITY,
    .bits      = CONFIG_UART5_BITS,
    .stopbits2 = CONFIG_UART5_2STOP,
    .txpin     = BOARD_UART5_TX_PIN,
    .rxpin     = BOARD_UART5_RX_PIN,
  },
};

static struct uart_dev_s g_uart5port =
{
  .recv =
  {
    .size   = sizeof(g_uart5rxbuffer),
    .buffer = g_uart5rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart5txbuffer),
    .buffer = g_uart5txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart5priv,
};

#endif

/* This describes the state of the NRF54L UART6 port. */

#ifdef CONFIG_NRF54L_UART6
static struct nrf54l_dev_s g_uart6priv =
{
  .uartbase = NRF54L_UART6_BASE,
  .irq      = NRF54L_IRQ_SERIAL24,
  .config   =
  {
    .baud      = CONFIG_UART6_BAUD,
    .parity    = CONFIG_UART6_PARITY,
    .bits      = CONFIG_UART6_BITS,
    .stopbits2 = CONFIG_UART6_2STOP,
    .txpin     = BOARD_UART6_TX_PIN,
    .rxpin     = BOARD_UART6_RX_PIN,
  },
};

static struct uart_dev_s g_uart6port =
{
  .recv =
  {
    .size   = sizeof(g_uart6rxbuffer),
    .buffer = g_uart6rxbuffer,
  },
  .xmit =
  {
    .size   = sizeof(g_uart6txbuffer),
    .buffer = g_uart6txbuffer,
  },
  .ops  = &g_uart_ops,
  .priv = &g_uart6priv,
};

#endif

/* This table lets us iterate over the configured UARTs */

static struct uart_dev_s * const g_uart_devs[NRF54L_NUART] =
{
#ifdef CONFIG_NRF54L_UART0
  [0] = &g_uart0port,
#endif
#ifdef CONFIG_NRF54L_UART1
  [1] = &g_uart1port,
#endif
#ifdef CONFIG_NRF54L_UART2
  [2] = &g_uart2port,
#endif
#ifdef CONFIG_NRF54L_UART3
  [3] = &g_uart3port,
#endif
#ifdef CONFIG_NRF54L_UART4
  [4] = &g_uart4port,
#endif
#ifdef CONFIG_NRF54L_UART5
  [5] = &g_uart5port,
#endif
#ifdef CONFIG_NRF54L_UART6
  [6] = &g_uart6port,
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf54l_uart_putreg
 *
 * Description:
 *   Write a UART register.
 *
 ****************************************************************************/

static inline void nrf54l_uart_putreg(struct nrf54l_dev_s *priv,
                                      uint32_t offset, uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: nrf54l_uart_getreg
 *
 * Description:
 *   Read a UART register.
 *
 ****************************************************************************/

static inline uint32_t nrf54l_uart_getreg(struct nrf54l_dev_s *priv,
                                          uint32_t offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: nrf54l_uart_clrevent
 *
 * Description:
 *   Clear a UARTE event and read it back before returning.
 *
 ****************************************************************************/

static void nrf54l_uart_clrevent(struct nrf54l_dev_s *priv, uint32_t event)
{
  nrf54l_uart_putreg(priv, event, 0);
  (void)nrf54l_uart_getreg(priv, event);
}

/****************************************************************************
 * Name: nrf54l_rxstart
 *
 * Description:
 *   Start reception and queue the first one-byte DMA buffer.
 *
 ****************************************************************************/

static void nrf54l_rxstart(struct nrf54l_dev_s *priv)
{
  priv->rxactive = true;
  priv->rxvalid = false;
  nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET);
  nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_DMA_RX_READY_OFFSET);
  nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_DMA_RX_PTR_OFFSET,
                     (uintptr_t)&priv->rxdma);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_DMA_RX_MAXCNT_OFFSET, 1);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_SHORTS_OFFSET,
                     UARTE_SHORTS_DMA_TX_END_STOP);
  UP_DMB();
  nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STARTRX_OFFSET, 1);
}

/****************************************************************************
 * Name: nrf54l_txstart
 *
 * Description:
 *   Start a one-byte DMA transfer. The caller must serialize access.
 *
 ****************************************************************************/

