apache/nuttx/arch/arm/src/nrf54l/nrf54l_serial.c
static void nrf54l_txstart(struct nrf54l_dev_s *priv, int ch)
{
  priv->txdma = ch;
  priv->txbusy = true;
  nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_DMA_TX_END_OFFSET);
  nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_DMA_TX_PTR_OFFSET,
                     (uintptr_t)&priv->txdma);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_DMA_TX_MAXCNT_OFFSET, 1);
  UP_DMB();
  nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STARTTX_OFFSET, 1);
}

/****************************************************************************
 * Name: nrf54l_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int nrf54l_setup(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = dev->priv;

  return nrf54l_usart_configure(priv->uartbase, &priv->config);
}

/****************************************************************************
 * Name: nrf54l_shutdown
 *
 * Description:
 *   Disable the UART. This method is not called for the serial console.
 *
 ****************************************************************************/

static void nrf54l_shutdown(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = dev->priv;

  nrf54l_usart_disable(priv->uartbase, &priv->config);
}

/****************************************************************************
 * Name: nrf54l_attach
 *
 * Description:
 *   Configure the UART to operate in interrupt driven mode. This method
 *   is called when the serial port is opened, normally just after setup.
 *   DMA completion interrupts release buffers even when delivery to the
 *   upper half is disabled by the rxint() and txint() methods.
 *
 ****************************************************************************/

static int nrf54l_attach(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = (struct nrf54l_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, nrf54l_interrupt, dev);
  if (ret == OK)
    {
#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      nrf54l_uart_putreg(priv, NRF54L_UARTE_INTENSET_OFFSET, RX_INTERRUPTS |
                         UARTE_INT_TXSTOPPED | UARTE_INT_DMA_TX_BUSERROR);
      up_enable_irq(priv->irq);
      nrf54l_rxstart(priv);
#endif
    }

  return ret;
}

/****************************************************************************
 * Name: nrf54l_detach
 *
 * Description:
 *   Detach UART interrupts. This method is called when the serial port is
 *   closed normally just before the shutdown method is called.
 *   The exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void nrf54l_detach(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = (struct nrf54l_dev_s *)dev->priv;

  /* Stop DMA before detaching the interrupt handler */

  nrf54l_uart_putreg(priv, NRF54L_UARTE_INTENCLR_OFFSET, UINT32_MAX);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_SHORTS_OFFSET,
                     UARTE_SHORTS_DMA_TX_END_STOP);
  if (priv->rxactive)
    {
      /* Wait until the DMA buffer is released before a subsequent attach. */

      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET);
      nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STOPRX_OFFSET, 1);
      while (!nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET))
        {
        }

      priv->rxactive = false;
      priv->rxrecover = false;
    }

  if (priv->txbusy)
    {
      while (!nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET))
        {
        }

      priv->txbusy = false;
    }

  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: nrf54l_interrupt
 *
 * Description:
 *   Handle receive buffers, transfer completion and DMA errors.
 *
 ****************************************************************************/

static int nrf54l_interrupt(int irq, void *context, void *arg)
{
  struct uart_dev_s *dev = arg;
  struct nrf54l_dev_s *priv = dev->priv;

  if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_ERROR_OFFSET))
    {
      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_ERROR_OFFSET);
      priv->rxstatus |=
        nrf54l_uart_getreg(priv, NRF54L_UARTE_ERRORSRC_OFFSET);
      nrf54l_uart_putreg(priv, NRF54L_UARTE_ERRORSRC_OFFSET, priv->rxstatus);
    }

  if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET))
    {
      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET);
      priv->rxrecover = true;
      nrf54l_uart_putreg(priv, NRF54L_UARTE_SHORTS_OFFSET,
                         UARTE_SHORTS_DMA_TX_END_STOP);
      nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STOPRX_OFFSET, 1);
    }

  if (priv->rxrecover)
    {
      if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET))
        {
          priv->rxrecover = false;
          nrf54l_rxstart(priv);
        }
    }
  else
    {
      /* Copy the completed byte before restarting DMA. Automatic END-to-
       * START would let DMA overwrite a buffer before the interrupt handler
       * consumes it. The UART FIFO holds incoming bytes between transfers.
       */

      if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET))
        {
          nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_DMA_RX_END_OFFSET);
          UP_DMB();
          priv->rxchar = priv->rxdma;
          priv->rxvalid = true;
          UP_DMB();
          nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STARTRX_OFFSET, 1);
        }

      if (priv->rxvalid && priv->rxenabled)
        {
          uart_recvchars(dev);
        }

      priv->rxvalid = false;
      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET);
    }

  if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET))
    {
      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_DMA_TX_BUSERROR_OFFSET);
      nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STOPTX_OFFSET, 1);
    }

  if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET))
    {
      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET);
      priv->txbusy = false;
      if (priv->txenabled)
        {
          uart_xmitchars(dev);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: nrf54l_set_format
 *
 * Description:
 *   Set the serial line format and speed with DMA stopped.
 *
 ****************************************************************************/

#ifdef CONFIG_SERIAL_TERMIOS
static int nrf54l_set_format(struct uart_dev_s *dev,
                             const struct uart_config_s *config)
{
  struct nrf54l_dev_s *priv = dev->priv;
  irqstate_t flags;
  uint32_t enabled;
  int ret;

  flags = enter_critical_section();

