apache/nuttx/arch/arm/src/nrf54l/nrf54l_serial.c
  /* Do not change the format of a byte still being transmitted or
   * interrupt DMA error recovery.
   */

  if (priv->txbusy || priv->rxrecover)
    {
      leave_critical_section(flags);
      return -EBUSY;
    }

  if (priv->rxactive)
    {
      nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET);
      nrf54l_uart_putreg(priv, NRF54L_UARTE_TASKS_STOPRX_OFFSET, 1);
      while (!nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_RXTO_OFFSET))
        {
        }

      /* STOP also generates END for an empty buffer. Deliver a completed
       * byte before restarting DMA, but never deliver an empty buffer.
       */

      if (nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_ERROR_OFFSET))
        {
          nrf54l_uart_clrevent(priv, NRF54L_UARTE_EVENTS_ERROR_OFFSET);
          priv->rxstatus |=
            nrf54l_uart_getreg(priv, NRF54L_UARTE_ERRORSRC_OFFSET);
          nrf54l_uart_putreg(priv, NRF54L_UARTE_ERRORSRC_OFFSET,
                             priv->rxstatus);
        }

      if (nrf54l_uart_getreg(priv, NRF54L_UARTE_DMA_RX_AMOUNT_OFFSET) != 0 &&
          !nrf54l_uart_getreg(priv,
                              NRF54L_UARTE_EVENTS_DMA_RX_BUSERROR_OFFSET))
        {
          UP_DMB();
          priv->rxchar = priv->rxdma;
          priv->rxvalid = true;
          if (priv->rxenabled)
            {
              uart_recvchars(dev);
            }
        }
    }

  enabled = nrf54l_uart_getreg(priv, NRF54L_UARTE_ENABLE_OFFSET);
  nrf54l_uart_putreg(priv, NRF54L_UARTE_ENABLE_OFFSET, 0);
  ret = nrf54l_usart_setformat(priv->uartbase, config);
  if (ret == OK)
    {
      priv->config = *config;
    }

  nrf54l_uart_putreg(priv, NRF54L_UARTE_ENABLE_OFFSET, enabled);
  if (priv->rxactive)
    {
      nrf54l_rxstart(priv);
    }

  leave_critical_section(flags);
  return ret;
}
#endif

/****************************************************************************
 * Name: nrf54l_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method
 *
 ****************************************************************************/

static int nrf54l_ioctl(struct file *filep, int cmd, unsigned long arg)
{
#ifdef CONFIG_SERIAL_TERMIOS
  struct inode         *inode  = filep->f_inode;
  struct uart_dev_s    *dev    = inode->i_private;
  struct nrf54l_dev_s  *priv   = dev->priv;
  struct uart_config_s config;
  irqstate_t flags;
#endif
  int ret = OK;

  switch (cmd)
    {
#ifdef CONFIG_SERIAL_TERMIOS
      case TCGETS:
        {
          struct termios *termiosp = (struct termios *)arg;

          if (!termiosp)
            {
              ret = -EINVAL;
              break;
            }

          flags = enter_critical_section();
          config = priv->config;
          leave_critical_section(flags);

          termiosp->c_cflag = ((config.parity != 0) ? PARENB : 0)
                              | ((config.parity == 1) ? PARODD : 0)
                              | ((config.stopbits2) ? CSTOPB : 0);

          switch (config.bits)
            {
              case 5:
                termiosp->c_cflag |= CS5;
                break;

              case 6:
                termiosp->c_cflag |= CS6;
                break;

              case 7:
                termiosp->c_cflag |= CS7;
                break;

              default:
                termiosp->c_cflag |= CS8;
                break;
            }

          cfsetispeed(termiosp, config.baud);
          break;
        }

      case TCSETS:
        {
          struct termios *termiosp = (struct termios *)arg;

          if (!termiosp)
            {
              ret = -EINVAL;
              break;
            }

          /* Hardware flow control is not supported. */

          if ((termiosp->c_cflag & (CCTS_OFLOW | CRTS_IFLOW)) != 0)
            {
              ret = -EINVAL;
              break;
            }

          flags = enter_critical_section();
          config = priv->config;
          leave_critical_section(flags);

          switch (termiosp->c_cflag & CSIZE)
            {
              case CS5:
                config.bits = 5;
                break;

              case CS6:
                config.bits = 6;
                break;

              case CS7:
                config.bits = 7;
                break;

              case CS8:
                config.bits = 8;
                break;

              default:
                return -EINVAL;
            }

          /* Parity */

          if (termiosp->c_cflag & PARENB)
            {
              config.parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
            }
          else
            {
              config.parity = 0;
            }

          /* Stop bits */

          config.stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;

          /* Note that only cfgetispeed is used because we have knowledge
           * that only one speed is supported.
           */

          config.baud = cfgetispeed(termiosp);

          /* Effect the changes */

          ret = nrf54l_set_format(dev, &config);
          break;
        }
#endif

      default:
        {
          ret = -ENOTTY;
          break;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: nrf54l_receive
 *
 * Description:
 *   Called (usually) from the interrupt level to receive one
 *   character from the UART.  Error bits associated with the
 *   receipt are provided in the return 'status'.
 *
 ****************************************************************************/

static int nrf54l_receive(struct uart_dev_s *dev, unsigned int *status)
{
  struct nrf54l_dev_s *priv = dev->priv;

  if (status)
    {
      *status = priv->rxstatus;
    }

  priv->rxstatus = 0;
  priv->rxvalid = false;
  return priv->rxchar;
}

/****************************************************************************
 * Name: nrf54l_rxint
 *
 * Description:
 *   Enable or disable delivery of received characters to the upper half.
 *
 ****************************************************************************/

static void nrf54l_rxint(struct uart_dev_s *dev, bool enable)
{
  struct nrf54l_dev_s *priv = dev->priv;

