apache/nuttx/arch/arm/src/nrf54l/nrf54l_serial.c
#ifdef CONFIG_SUPPRESS_SERIAL_INTS
  priv->rxenabled = false;
#else
  priv->rxenabled = enable;
#endif
}

/****************************************************************************
 * Name: nrf54l_rxavailable
 *
 * Description:
 *   Report whether a received character is waiting for the upper half.
 *
 ****************************************************************************/

static bool nrf54l_rxavailable(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = dev->priv;

  return priv->rxvalid;
}

/****************************************************************************
 * Name: nrf54l_send
 *
 * Description:
 *   Start transmitting the character supplied by the upper half.
 *
 ****************************************************************************/

static void nrf54l_send(struct uart_dev_s *dev, int ch)
{
  struct nrf54l_dev_s *priv = dev->priv;
  irqstate_t flags = enter_critical_section();

  nrf54l_txstart(priv, ch);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: nrf54l_txint
 *
 * Description:
 *   Enable or disable transmission from the upper-half transmit buffer.
 *
 ****************************************************************************/

static void nrf54l_txint(struct uart_dev_s *dev, bool enable)
{
  struct nrf54l_dev_s *priv = dev->priv;
  irqstate_t flags = enter_critical_section();

#ifdef CONFIG_SUPPRESS_SERIAL_INTS
  enable = false;
#endif

  priv->txenabled = enable;
  if (enable)
    {
      uart_xmitchars(dev);
    }

  leave_critical_section(flags);
}

/****************************************************************************
 * Name: nrf54l_txready
 *
 * Description:
 *   Report whether the transmitter can accept another character.
 *
 ****************************************************************************/

static bool nrf54l_txready(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = dev->priv;

  return !priv->txbusy;
}

/****************************************************************************
 * Name: nrf54l_txempty
 *
 * Description:
 *   Return true if the transmit data register is empty
 *
 ****************************************************************************/

static bool nrf54l_txempty(struct uart_dev_s *dev)
{
  struct nrf54l_dev_s *priv = dev->priv;

  return !priv->txbusy;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf54l_earlyserialinit
 *
 * Description:
 *   Performs the low level UART initialization early in debug so that the
 *   serial console will be available during boot up.  This must be called
 *   before arm_serialinit.  NOTE: This function depends on GPIO pin
 *   configuration performed in nrf54l_lowsetup() and main clock
 *   initialization performed in nrf54l_clockconfig().
 *
 ****************************************************************************/

#ifdef USE_EARLYSERIALINIT
void nrf54l_earlyserialinit(void)
{
  /* Configure whichever one is the console */

#ifdef HAVE_UART_CONSOLE
  CONSOLE_DEV.isconsole = true;
  nrf54l_setup(&CONSOLE_DEV);
#endif
}
#endif

/****************************************************************************
 * Name: arm_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes
 *   that nrf54l_earlyserialinit was called previously.
 *
 * Input Parameters:
 *   None
 *
 * Returns Value:
 *   None
 *
 ****************************************************************************/

void arm_serialinit(void)
{
  unsigned minor = 0;
  unsigned i     = 0;
  char devname[16];

#ifdef HAVE_UART_CONSOLE
  /* Register the serial console */

  CONSOLE_DEV.isconsole = true;
  uart_register("/dev/console", &CONSOLE_DEV);
  uart_register("/dev/ttyS0", &TTYS0_DEV);
  minor = 1;
#endif

  /* Register all remaining UARTs */

  strlcpy(devname, "/dev/ttySx", sizeof(devname));

  for (i = 0; i < NRF54L_NUART; i++)
    {
      /* Don't create a device for non-configured ports. */

      if (g_uart_devs[i] == NULL)
        {
          continue;
        }

      /* Don't create a device for the console - we did that above */

      if (g_uart_devs[i]->isconsole)
        {
          continue;
        }

      /* Register USARTs as devices in increasing order */

      devname[9] = '0' + minor++;
      uart_register(devname, g_uart_devs[i]);
    }
}

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes.
 *
 ****************************************************************************/

void up_putc(int ch)
{
#ifdef HAVE_UART_CONSOLE
  struct nrf54l_dev_s *priv = CONSOLE_DEV.priv;
  irqstate_t flags = enter_critical_section();

  /* Serialize polled debug output with the interrupt-driven transmitter.
   * TXSTOPPED, rather than DMA END, guarantees the pin is idle before reuse.
   */

  if (priv->txbusy)
    {
      while (!nrf54l_uart_getreg(priv, NRF54L_UARTE_EVENTS_TXSTOPPED_OFFSET))
        {
        }
    }

  arm_lowputc(ch);
  priv->txbusy = false;
  leave_critical_section(flags);
#endif
}

#else /* HAVE_UART_DEVICE && USE_SERIALDRIVER */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes.
 *
 ****************************************************************************/

void up_putc(int ch)
{
  arm_lowputc(ch);
}

#endif /* HAVE_UART_DEVICE && USE_SERIALDRIVER */
